# GetRebarRoundingManager Method (2023)

---
C#Visual BasicVisual C++
Revit 2023 API
---
ReinforcementSettings..::..GetRebarRoundingManager Method
ReinforcementSettings Class See Also
---
Returns an object for managing reinforcement rounding override settings used by RebarBarTypes, Rebar and RebarInSystem elements.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)**Since:** 2014
# Syntax
C#
---
```text
public RebarRoundingManager GetRebarRoundingManager()
```

Visual Basic
---
```text
Public Function GetRebarRoundingManager As RebarRoundingManager
```

Visual C++
---
```text
public:
RebarRoundingManager^ GetRebarRoundingManager()
```

# ### Return Value
The rounding manager.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..DisabledDisciplineException | None of the following disciplines is enabled: Structural. |

# See Also
ReinforcementSettings Class
Autodesk.Revit.DB.Structure Namespace